## Staging: app
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 2 to add, 2 to change, 2 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_lambda_function.archiver will be updated in-place
  ~ resource "aws_lambda_function" "archiver" {
        id                             = "Archiver"
        tags                           = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (20 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DYNAMODB_VAULT_INDEX_NAME" = jsonencode(
                    [
                      - "retrieved-index",
                    ]
                ) -> "retrieved-index"
                # (4 unchanged elements hidden)
            }
        }

        # (1 unchanged block hidden)
    }

  # aws_lambda_function.reliability will be updated in-place
  ~ resource "aws_lambda_function" "reliability" {
        id                             = "Reliability"
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:687401027353:layer:reliability_lib_packages:59",
          - "arn:aws:lambda:ca-central-1:687401027353:layer:reliability_node_packages:67",
        ] -> (known after apply)
        tags                           = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (25 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_layer_version.reliability_lib must be replaced
-/+ resource "aws_lambda_layer_version" "reliability_lib" {
      ~ arn                         = "arn:aws:lambda:ca-central-1:687401027353:layer:reliability_lib_packages:59" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2021-12-22T14:50:09.039+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ca-central-1:687401027353:layer:reliability_lib_packages:59" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ca-central-1:687401027353:layer:reliability_lib_packages" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "ku4dhZMcNr/hiGkN9ukcoHOSXP9xWu3LcX4y8grJBHc=" -> "ezK7D3vwa4I9MKwlSoPdppepyxJ0X+6EYWvUMDWAiU0=" # forces replacement
      ~ source_code_size            = 5647 -> (known after apply)
      ~ version                     = "59" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_lambda_layer_version.reliability_nodejs must be replaced
-/+ resource "aws_lambda_layer_version" "reliability_nodejs" {
      ~ arn                         = "arn:aws:lambda:ca-central-1:687401027353:layer:reliability_node_packages:67" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2021-12-22T14:50:14.130+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ca-central-1:687401027353:layer:reliability_node_packages:67" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ca-central-1:687401027353:layer:reliability_node_packages" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "CsMWtRhZ9tALeLaggMg+kHGWGEQIwwcPav5p+i5rGos=" -> "TQsmz4NtH/pNBb49tT01ldVxCfvXGL23tRG7ywBp/SA=" # forces replacement
      ~ source_code_size            = 4813579 -> (known after apply)
      ~ version                     = "67" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 2 to add, 2 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cron_4am_every_day"]

9 tests, 8 passed, 1 warning, 0 failures, 0 exceptions

```

</details>
